"""
    < 변수명 작명 규칙 >
    1. 숫자로 시작할 수 없다.
        n2 = 10 (O)     2n = 20 (X)

    2. 띄어쓰기는 포함할 수 없다.
        my_age = 10 (O) my age = 10 (X)

    3. 특수기호는 '_'만 가능하다.

    4. 한글도 가능하다. 하지만 비추천.

    5. 예약어는 변수명이 될 수 없다.

    6. 함수의 이름을 변수명으로 사용할 수 있지만 이후 명령부터는 해당 함수를 사용할 수 없다.
        ** 여기서 함수란, 단어() <== 소괄호가 붙는 단어 (print(), type() 등)
        print("ㅎㅇㅎㅇ")    # ㅎㅇㅎㅇ 출력 됨
        print = 10          # 여기서부터는 print()를 사용할 수 없음 (print 단어는 이후부터 변수이름으로 사용됨)
        print("ㅎㅇㅎㅇ")    # 에러!


    TODO
        원의 넓이로 과제 내기
        헝가리안, 파스칼, 카멜 표기법 등

"""

